spec/data/stripe/charge.json

{
  "id": "ch_1Cgkfs2eZvKYlo2CVPsK4I3f",
  "object": "charge",
  "amount": 10000,
  "amount_refunded": 0,
  "application": null,
  "application_fee": null,
  "balance_transaction": "txn_19XJJ02eZvKYlo2ClwuJ1rbA",
  "captured": true,
  "created": 1529894608,
  "currency": "usd",
  "customer": null,
  "description": "Payment",
  "destination": "acct_1AojmwI9Pbw6jkMZ",
  "dispute": null,
  "failure_code": null,
  "failure_message": null,
  "fraud_details": {
  },
  "invoice": null,
  "livemode": false,
  "metadata": {
  },
  "on_behalf_of": "acct_1AojmwI9Pbw6jkMZ",
  "order": null,
  "outcome": {
    "network_status": "approved_by_network",
    "reason": null,
    "risk_level": "normal",
    "seller_message": "Payment complete.",
    "type": "authorized"
  },
  "paid": true,
  "receipt_email": null,
  "receipt_number": null,
  "refunded": false,
  "refunds": {
    "object": "list",
    "data": [

    ],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/charges/ch_1Cgkfs2eZvKYlo2CVPsK4I3f/refunds"
  },
  "review": null,
  "shipping": null,
  "source": {
    "id": "card_1Cgkfs2eZvKYlo2CwlgKmpmN",
    "object": "card",
    "address_city": null,
    "address_country": null,
    "address_line1": null,
    "address_line1_check": null,
    "address_line2": null,
    "address_state": null,
    "address_zip": null,
    "address_zip_check": null,
    "brand": "Visa",
    "country": "US",
    "customer": null,
    "cvc_check": null,
    "dynamic_last4": null,
    "exp_month": 6,
    "exp_year": 2019,
    "fingerprint": "Xt5EWLLDS7FJjR1c",
    "funding": "credit",
    "last4": "4242",
    "metadata": {
    },
    "name": null,
    "tokenization_method": null
  },
  "source_transfer": null,
  "statement_descriptor": "Rocketship, Inc.",
  "status": "succeeded",
  "transfer": "tr_1Cgkft2eZvKYlo2CT76OVlBZ",
  "transfer_group": "group_ch_1Cgkfs2eZvKYlo2CVPsK4I3f"
}
